squareCylinderLESNew/testCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	 2.0;
    format	 ascii;
    class	 dictionary;
    object	 blockMeshDict;
}

convertToMeters	 1.0;

#include "../parameters"

vertices
(
    // Z=0 plane
    (0   0   0)    // vertex 0
    ($X1 0   0)    // vertex 1
    ($X2 0   0)    // vertex 2
    ($X3 0   0)    // vertex 3
    ($X3 $Y1 0)    // vertex 4
    ($X2 $Y1 0)    // vertex 5
    ($X1 $Y1 0)    // vertex 6
    (0   $Y1 0)    // vertex 7
    (0   $Y2 0)    // vertex 8
    ($X1 $Y2 0)    // vertex 9
    ($X2 $Y2 0)    // vertex 10
    ($X3 $Y2 0)    // vertex 11
    ($X3 $Y3 0)    // vertex 12
    ($X2 $Y3 0)    // vertex 13
    ($X1 $Y3 0)    // vertex 14
    (0   $Y3 0)    // vertex 15
 
    // Z=H plane
    (0   0   $Z1)    // vertex 16
    ($X1 0   $Z1)    // vertex 17
    ($X2 0   $Z1)    // vertex 18
    ($X3 0   $Z1)    // vertex 19
    ($X3 $Y1 $Z1)    // vertex 20
    ($X2 $Y1 $Z1)    // vertex 21
    ($X1 $Y1 $Z1)    // vertex 22
    (0   $Y1 $Z1)    // vertex 23
    (0   $Y2 $Z1)    // vertex 24
    ($X1 $Y2 $Z1)    // vertex 25
    ($X2 $Y2 $Z1)    // vertex 26
    ($X3 $Y2 $Z1)    // vertex 27
    ($X3 $Y3 $Z1)    // vertex 28
    ($X2 $Y3 $Z1)    // vertex 29
    ($X1 $Y3 $Z1)    // vertex 30
    (0   $Y3 $Z1)    // vertex 31

    // Z=10H plane
    (0   0   $Z2)    // vertex 32
    ($X1 0   $Z2)    // vertex 33
    ($X2 0   $Z2)    // vertex 34
    ($X3 0   $Z2)    // vertex 35
    ($X3 $Y1 $Z2)    // vertex 36
    ($X2 $Y1 $Z2)    // vertex 37
    ($X1 $Y1 $Z2)    // vertex 38
    (0   $Y1 $Z2)    // vertex 39
    (0   $Y2 $Z2)    // vertex 40
    ($X1 $Y2 $Z2)    // vertex 41
    ($X2 $Y2 $Z2)    // vertex 42
    ($X3 $Y2 $Z2)    // vertex 43
    ($X3 $Y3 $Z2)    // vertex 44
    ($X2 $Y3 $Z2)    // vertex 45
    ($X1 $Y3 $Z2)    // vertex 46
    (0   $Y3 $Z2)    // vertex 47
 
);

blocks
(
    // block 0
    hex (0 1 6 7 16 17 22 23)
    ($NX1 $NY1 $NZ1)
    simpleGrading ($ERX1 $ERY1 $ERZ1)

    // block 1
    hex (1 2 5 6 17 18 21 22)
    ($NX2 $NY1 $NZ1)
    simpleGrading ($ERX2 $ERY1 $ERZ1)

    // block 2
    hex (2 3 4 5 18 19 20 21)
    ($NX3 $NY1 $NZ1)
    simpleGrading ($ERX3 $ERY1 $ERZ1)

    // block 3
    hex (5 4 11 10 21 20 27 26)
    ($NX3 $NY2 $NZ1)
    simpleGrading ($ERX3 $ERY2 $ERZ1)

    // block 4
    hex (7 6 9 8 23 22 25 24)
    ($NX1 $NY2 $NZ1)
    simpleGrading ($ERX1 $ERY2 $ERZ1)

    // block 5
    hex (8 9 14 15 24 25 30 31)
    ($NX1 $NY3 $NZ1)
    simpleGrading ($ERX1 $ERY3 $ERZ1)

    // block 6
    hex (9 10 13 14 25 26 29 30)
    ($NX2 $NY3 $NZ1)
    simpleGrading ($ERX2 $ERY3 $ERZ1)

    // block 7
    hex (10 11 12 13 26 27 28 29)
    ($NX3 $NY3 $NZ1)
    simpleGrading ($ERX3 $ERY3 $ERZ1)

    // block 8
    hex (16 17 22 23 32 33 38 39)
    ($NX1 $NY1 $NZ2)
    simpleGrading ($ERX1 $ERY1 $ERZ2)

    // block 9
    hex (17 18 21 22 33 34 37 38)
    ($NX2 $NY1 $NZ2)
    simpleGrading ($ERX2 $ERY1 $ERZ2)

    // block 10
    hex (18 19 20 21 34 35 36 37)
    ($NX3 $NY1 $NZ2)
    simpleGrading ($ERX3 $ERY1 $ERZ2)

    // block 11
    hex (21 20 27 26 37 36 43 42)
    ($NX3 $NY2 $NZ2)
    simpleGrading ($ERX3 $ERY2 $ERZ2)

    // block 12
    hex (22 21 26 25 38 37 42 41)
    ($NX2 $NY2 $NZ2)
    simpleGrading ($ERX2 $ERY2 $ERZ2)

    // block 13
    hex (23 22 25 24 39 38 41 40)
    ($NX1 $NY2 $NZ2)
    simpleGrading ($ERX1 $ERY2 $ERZ2)

    // block 14
    hex (24 25 30 31 40 41 46 47)
    ($NX1 $NY3 $NZ2)
    simpleGrading ($ERX1 $ERY3 $ERZ2)

    // block 15 
    hex (25 26 29 30 41 42 45 46)
    ($NX2 $NY3 $NZ2)
    simpleGrading ($ERX2 $ERY3 $ERZ2)

    // block 16
    hex (26 27 28 29 42 43 44 45)
    ($NX3 $NY3 $NZ2)
    simpleGrading ($ERX3 $ERY3 $ERZ2)

);

edges
(
);

boundary
(

    inlet
    {
        type patch;
        faces
        (
            (0 16 23 7)
            (7 23 24 8)
            (8 24 31 15)
            (16 32 39 23)
            (23 39 40 24)
            (24 40 47 31)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 4 20 19)
            (4 11 27 20)
            (11 12 28 27)
            (19 20 36 35)
            (20 27 43 36)
            (27 28 44 43)
        );
    }

    ground
    {
        type wall;
        faces
        (
            (0 7 6 1)
            (1 6 5 2)
            (2 5 4 3)
            (5 10 11 4)
            (7 8 9 6)
            (8 15 14 9)
            (9 14 13 10)
            (10 13 12 11)
        );
    }

    building
    {
        type wall;
        faces
        (
            (6 9 25 22)
            (9 10 26 25)
            (10 5 21 26)
            (5 6 22 21)
            (21 22 25 26)
        );
    }

    sides
    {
        type symmetry;
        faces
        (
            (0 1 17 16)
            (1 2 18 17)
            (2 3 19 18)
            (16 17 33 32)
            (17 18 34 33)
            (18 19 35 34)

            (12 13 29 28)
            (13 14 30 29)
            (14 15 31 30)
            (28 29 45 44)
            (29 30 46 45)
            (30 31 47 46)
        );
    }

    top
    {
        type symmetry;
        faces
        (
            (32 33 38 39)
            (33 34 37 38)
            (34 35 36 37)
            (37 36 43 42)
            (38 37 42 41)
            (39 38 41 40)
            (40 41 46 47)
            (41 42 45 46)
            (42 43 44 45)
        );
    }

);

mergPatchPairs
(
);
