squareCylinderLESNew/testCase/system/boundaryCloudBuilding
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields at a cloud of points, interpolated to
    specified boundary patches.

\*---------------------------------------------------------------------------*/

fields ( p );

points
(
   #includeIfPresent "../buildingPatchFaceCentres" 
);

maxDistance 0.1;

patches     (".*");

#includeEtc "caseDicts/postProcessing/probes/boundaryCloud.cfg"

interpolationScheme    cellPatchConstrained;

setFormat    raw;

writeControl    timeStep;

// ************************************************************************* //
