squareCylinderLESNew/testCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../parameters"

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         6;

deltaT          1e-03;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep    no;

maxCo             0.5;

maxDeltaT         2.0e-3;

functions
{
    //#includeFunc totalPressureIncompressible
    #includeFunc probes
    #includeFunc boundaryCloudInlet
    #includeFunc boundaryCloudBuilding
    #includeFunc boundaryCloudOutlet
    #includeFunc singleGraphInlet
    #includeFunc singleGraphMidplane
    //#includeFunc forceCoeffsIncompressible
}

// ************************************************************************* //
